In [4]:
# Import pandas
import pandas as pd

In [5]:
# Create a sample DataFrame
data = {    
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve'],
    'Age': [25, 30, 35, 28, 22],
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Miami']
}

df = pd.DataFrame(data)
df

      Name  Age           City
0    Alice   25       New York
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago
4      Eve   22          Miami

# Basic DataFrame operations

In [6]:
# Selecting a single column
df['Name']

0      Alice
1        Bob
2    Charlie
3      David
4        Eve
Name: Name, dtype: object

In [7]:
# Selecting multiple columns
df[['Name', 'Age']]

      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   28
4      Eve   22

In [8]:
# Filtering data based on a condition
df[df['Age'] > 25]

      Name  Age           City
1      Bob   30  San Francisco
2  Charlie   35    Los Angeles
3    David   28        Chicago

In [9]:
# Aggregating data
df['Age'].mean()

28.0

In [10]:
# Sorting the DataFrame by a column
df.sort_values(by='Age', ascending=False)

      Name  Age           City
2  Charlie   35    Los Angeles
1      Bob   30  San Francisco
3    David   28        Chicago
0    Alice   25       New York
4      Eve   22          Miami

In [11]:
# Adding a new column
df['Country'] = ['USA', 'USA', 'USA', 'USA', 'USA']
print("Adding a 'Country' column:")
df

Adding a 'Country' column:

      Name  Age           City Country
0    Alice   25       New York     USA
1      Bob   30  San Francisco     USA
2  Charlie   35    Los Angeles     USA
3    David   28        Chicago     USA
4      Eve   22          Miami     USA

In [12]:
# Grouping and aggregating data
# Grouping by the 'City' column and calculating the average age in each city
city_avg_age = df.groupby('City')['Age'].mean()
print("Average age in each city:")
city_avg_age

Average age in each city:

City
Chicago          28.0
Los Angeles      35.0
Miami            22.0
New York         25.0
San Francisco    30.0
Name: Age, dtype: float64

In [13]:
# Merging two DataFrames
data2 = {
    'City': ['New York', 'San Francisco', 'Los Angeles', 'Chicago', 'Houston'],
    'Population (millions)': [8.4, 0.88, 3.8, 2.7, 2.3]
}

city_population = pd.DataFrame(data2)
merged_df = pd.merge(df, city_population, on='City')
print("\nMerged DataFrame:")
merged_df

Merged DataFrame:

      Name  Age           City Country  Population (millions)
0    Alice   25       New York     USA                   8.40
1      Bob   30  San Francisco     USA                   0.88
2  Charlie   35    Los Angeles     USA                   3.80
3    David   28        Chicago     USA                   2.70